{
    "basic_info": {
      "description_header": "Hello!",
      "description": "Hi, I’m Hugo Thompson, and I’m a Software Engineer. I started my coding journey about halfway through high school, where I found a game that had a repository anyone could contribute to. I thought the idea of that was really cool and so I self learned a bit of the language to contribute myself. And yeah, delivering features to players and solving long standing design issues for the game was extremely fun, as in, I began to enjoy coding more than I did the game I was coding for! This continued until I graduated, but then came covid, After a lot of deliberation on where I was going to take myself in life, I decided to continue my self learning instead of dealing with online college classes at full price, partially because I assumed covid wasn’t going to be as long as it ended up being. Boy was I wrong about that. I self learned some more for about two years and then decided to get some more formal education on being a software developer, since I had a lot of informal education but I didn’t know what I didn’t know. This led me to code fellows, where I’m currently learning more about the industry.",
      "section_name": {
        "about": "About me",
        "projects": "Projects",
        "skills": "Skills",
        "experience": "Experience"
      }
    },
    "projects": [
      {
        "title": "201 Final",
        "startDate": "2020",
        "description": "The end of my class on the \"Foundations of Software Development\", I decided to make a little browser game. Wow, what a crunch it turned into! And in the end, it just turned out alright, but what really makes me look back at the project with pride was the systems I made for it, like the popup system and the hintsystem. Super robust use of constructed types, so all in all I'm very happy I decided to take the path of most resistance.",
        "images": [
          "images/portfolio/201final/f-1.png",
          "images/portfolio/201final/f-2.png",
          "images/portfolio/201final/f-3.png"
        ],
        "url": "",
        "technologies": [
          {
            "class": "devicon-html5-plain",
            "name": "HTML5"
          },
          {
            "class": "devicon-css3-plain",
            "name": "CSS3"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          }
        ]
      },
      {
        "title": "Horned Beasts",
        "startDate": "2022",
        "description": "First react project for school, a little fun image repo site. I sure do get carried away with css styling, but it's genuinely fun to find things to improve about the site, even if just a school project people don't really care much about.",
        "images": [
          "images/portfolio/hornedbeasts/hb-1.png",
          "images/portfolio/hornedbeasts/hb-2.png"
        ],
        "url": "https://github.com",
        "technologies": [
          {
            "class": "devicon-react-original",
            "name": "React"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          }
        ]
      },
      {
        "title": "301 Final",
        "startDate": "2022",
        "description": "My final project for my react class, which will be here when I'm done!",
        "images": [
          "https://upload.wikimedia.org/wikipedia/commons/3/3f/Placeholder_view_vector.svg"
        ],
        "url": "https://github.com",
        "technologies": [
        ]
      }
    ],
    "experience": [
      {
        "company": "CodeFellows",
        "title": "Student",
        "years": "late 2019 - present",
        "mainTech": [
          "JavaScript"
        ],
        "technologies": [
          "HTML5",
          "CSS3",
          "JavaScript",
          "React"
        ]
      },
      {
        "company": "Open Source Contributions",
        "title": "Contributor",
        "years": "2017 and onwards",
        "mainTech": [
          "JavaScript"
        ],
        "technologies": [
          "DM",
          "JavaScript",
          "TypeScript"
        ]
      }
    ]
  }
